In [2]:
import pandas as pd

In [3]:
names = "Josh Larry Lori Ariel Ian".split(" ")
age = [26, 53, 51, 23, 19]
ed = "Some_grad Some_undergrad HS HS Some_HS".split(" ")
edYears = [18,14,12,12,10]

In [4]:
d = {
    "age": pd.Series(age,index=names),
    "ed" : pd.Series(ed,index=names),
    "yrs-ed" : pd.Series(edYears,index=names)
    }
df = pd.DataFrame(d)
df

       age              ed  yrs-ed
Josh    26       Some_grad      18
Larry   53  Some_undergrad      14
Lori    51              HS      12
Ariel   23              HS      12
Ian     19         Some_HS      10

In [5]:
df["Ed Yrs per Age"] = round(df['yrs-ed'] / df.age,2)
df

       age              ed  yrs-ed  Ed Yrs per Age
Josh    26       Some_grad      18            0.69
Larry   53  Some_undergrad      14            0.26
Lori    51              HS      12            0.24
Ariel   23              HS      12            0.52
Ian     19         Some_HS      10            0.53